[
	{
		"username": "auth0|662a1b785717fb24bc6e3103",
		"rid": 1,
		"rating": 5,
		"comment": "哇，这个福建炒面真的是很有特色！虽然跟我们这边的炒面不太一样，但那个香味和口感都很好，吃了很满足！"
	},
	{
		"username": "auth0|662a1bef93cc4d2e64f5b17b",
		"rid": 1,
		"rating": 4,
		"comment": "福建炒麵袂䆀，麵條炒了拄仔好，口感嘛足𩚨喔。彼个味足芳，只是比我想的淡薄仔較薄仔。毋過整體來講嘛是閣滿意！"
	},
	{
		"username": "auth0|662a1c0093cc4d2e64f5b185",
		"rid": 1,
		"rating": 2,
		"comment": "有啲令人失望。麵缺乏質感，味道亦唔夠濃 —— 好似調味太平凡噉。相比起香港嘅炒麵，呢個就落後。"
	},
	{
		"username": "auth0|662a1bdc4da8ec45371eb422",
		"rid": 1,
		"rating": 4,
		"comment": "This Hokkien Char Mee not as shiok as Singapore one, but still sibei solid lah! Got that wok hei and flavour, but bo kick we get back home. Still, boleh makan anytime! Sedap, but Singapore one bo beh zao siah!"
	},
	{
		"username": "auth0|662a1c1093cc4d2e64f5b18f",
		"rid": 2,
		"rating": 4,
		"comment": "The Bak kut teh turned out really flavourful, with the pork tender and the broth rich. The peppercorns gave it a nice kick, though I found the dish a bit too spicy for my taste. Overall, a solid recipe and a great introduction to this dish!"
	},
	{
		"username": "auth0|662a1c0093cc4d2e64f5b185",
		"rid": 2,
		"rating": 5,
		"comment": "這道肉骨茶做了有夠好的，湯頭濃鬱，豬肉煮了足幼的，芳料的味嘛足到位。特別是豆腐泡欶著湯的味，非常好食！這个食譜真正正，足佮意的！"
	},
	{
		"username": "auth0|662a1bdc4da8ec45371eb422",
		"rid": 2,
		"rating": 3,
		"comment": "This Bak kut teh u decent flavour lah, but missing a bit of the shiokness. The pork and soup cooked baik, but wa gamgak chili sibei heavy sia. If boleh adjust spiciness, it’ll be lebih swee lah!"
	},
	{
		"username": "auth0|662a1bca96132b5427cffe73",
		"rid": 3,
		"rating": 5,
		"comment": "這道海南雞飯真正做甲足好的！雞肉幼滑，米飯芳貢貢的，配起去醬料有夠好食的。王焌賢先生的配方真準，完全體現了海南雞飯的精髓。傷佮意矣！"
	},
	{
		"username": "auth0|662a1b785717fb24bc6e3103",
		"rid": 3,
		"rating": 5,
		"comment": "这个海南雞飯太美味了！鸡肉滑嫩入味，米饭香气扑鼻，搭配的酱料也是一绝。作者的食谱做出来的效果非常好，真的很佩服！"
	},
	{
		"username": "auth0|662a1c1093cc4d2e64f5b18f",
		"rid": 3,
		"rating": 5,
		"comment": "This Hailam kue png is excellent! The chicken is incredibly juicy, and the rice has absorbed all the flavours perfectly. The recipe is straightforward and very well-executed. Kudos to Keane for such a great dish!"
	},
	{
		"username": "auth0|662a1bef93cc4d2e64f5b17b",
		"rid": 3,
		"rating": 5,
		"comment": "這道海南雞飯根本是一絕！雞肉煮了拄仔好，米飯吸收雞肉的精華，食起來是真滿足啦。感謝王焌賢分享這个經典食譜，做起來的效果有夠好！"
	},
	{
		"username": "auth0|662a1c0093cc4d2e64f5b185",
		"rid": 3,
		"rating": 5,
		"comment": "呢個海南雞飯真係一流嘅美食！雞肉煮得啱啱好，米飯香氣濃郁，醬料非常提味。王焌賢先生嘅食譜好精準，做出嚟嘅效果非常棒，讚！"
	}
]