[
  {
    "title": "Hokkien char mee",
    "chinTitle": "福建炒麵",
    "cuisine": "MY",
    "username": "auth0|662a1b785717fb24bc6e3103",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 8,
    "picture": "https://images.lifestyleasia.com/wp-content/uploads/sites/6/2023/07/26191620/KL-Hokkien-Mee-on-Long-Plate.jpg",
    "ingredients": [
      "12 ounces skin-on lean pork belly",
      "½ teaspoon salt",
      "8 ounces shrimp",
      "2 tablespoons oyster sauce",
      "½ teaspoon sesame oil",
      "¼ teaspoon ground white pepper",
      "2 tablespoons Thai sweet soy sauce",
      "3 tablespoons Thai black soy sauce",
      "1 tablespoon Thai thin soy sauce",
      "2/3 cup low sodium chicken stock or pork stock",
      "3 cloves garlic",
      "2 cups Taiwanese cabbage",
      "2 ½ cups napa cabbage",
      "1 tablespoon Shaoxing wine",
      "1 pound hokkien noodles",
      "2 tablespoons cornstarch"
    ],
    "recipeInstructions": [
      "Cut pork belly in half lengthwise, separating lean from fatty part.",
      "Slice lean pork belly into ⅛-inch slices (about 6 ounces).",
      "Trim skin from fatty pork belly, then slice into ¼-inch pieces and halve.",
      "In cast iron pan, cook fatty pork with salt and ½ cup water until fat renders.",
      "Simmer on low for 15 mins until golden and crisp. Set aside on paper towel.",
      "Rinse shrimp; velvet if desired. Combine oyster sauce, sesame oil, pepper, soy sauces, and stock. Set aside.",
      "Heat wok, add 2 tsp pork lard. Sear pork belly, remove. Add 2 tsp lard, cook shrimp, set aside.",
      "Add 1 tbsp lard, garlic, cabbage. Stir-fry, add Shaoxing wine. Add noodles, toss.",
      "Pour in sauce, stir-fry until simmering. Add pork belly and shrimp, stir to combine.",
      "Stir in half of cornstarch mixture. Adjust thickness with more slurry or water if needed.",
      "Transfer to serving dish, sprinkle pork cracklings on top, and serve!"
    ]
  },
  {
    "title": "Bak kut teh",
    "chinTitle": "肉骨茶",
    "cuisine": "MY-07",
    "username": "auth0|662a1bca96132b5427cffe73",
    "prepTime": 15,
    "cookTime": 120,
    "servings": 1,
    "picture": "https://i0.wp.com/bobotravel.tw/wp-content/uploads/2020/01/%E6%96%B0%E7%83%BD%E8%82%89%E9%AA%A8%E8%8C%B616-scaled.jpg?fit=2560%2C1707&amp;ssl=1",
    "ingredients": [
      "1 whole rack of spare ribs, cut into 2 inch pieces",
      "1 lb. pork belly, cut into bite sized pieces, skin removed",
      "3 tbsp white peppercorns",
      "2 tsp black peppercorns",
      "3 star anise",
      "3 inch cinnamon or cassia stick",
      "15 cloves garlic, lightly crushed",
      "5 dried shitake mushrooms, quartered",
      "½ lb. tofu puffs",
      "2 tbsp light soy sauce",
      "2 tbsp fish sauce",
      "Red bird’s eye chillies, finely chopped",
      "Light soy sauce"
    ],
    "recipeInstructions": [
      "Coarsely grind black and white peppercorns. Combine with star anise and cinnamon, tie tightly, and set aside.",
      "Boil pork ribs and belly in water. After 10 minutes, strain and wash off any impurities.",
      "Return pork to pot with 2 ½ liters water, simmer for 10 minutes, and skim off foam.",
      "Add tied spices and garlic, simmer covered for 30 minutes. Stir in mushrooms and tofu puffs, simmer covered for 30-45 minutes until pork is tender.",
      "Add soy sauce and fish sauce to taste. Divide into 4 bowls. Serve hakken style with rice and chili soy sauce.",
      "For chili soy sauce, pour light soy sauce into 4 bowls and add finely chopped red chilies to taste."
    ]
  },
  {
    "title": "Hailam kue png",
    "chinTitle": "海南雞飯",
    "cuisine": "SG",
    "username": "auth0|662a1bdc4da8ec45371eb422",
    "prepTime": 5,
    "cookTime": 150,
    "servings": 6,
    "picture": "https://kwokspots.com/wp-content/uploads/2022/04/hchicken-far.png",
    "ingredients": [
      "1 fresh or organic chicken (3-3½ pounds)",
      "1 tablespoon salt",
      "12-14 cups water",
      "4-5 slices ginger",
      "2 whole scallions",
      "Ice",
      "Chicken fat",
      "4 cloves garlic (minced)",
      "3 cups uncoooked white rice (preferably jasmine rice, washed and drained)",
      "Chicken stock (from cooking the chicken)",
      "2 teaspoons salt",
      "4-inch piece ginger (roughly chopped)",
      "1 clove garlic",
      "3 tablespoons oil",
      "pinch of salt"
    ],
    "recipeInstructions": [
      "Wash chicken, set aside chicken fat. Pat dry, rub with salt, and set aside.",
      "Boil water with ginger and scallions. Rinse chicken, lower into boiling water breast-side up. Adjust water level to cover chicken breast.",
      "After boiling, lift chicken to pour out trapped water. Lower chicken back, bring to boil, cover, turn off heat, and leave covered for 45-50 mins.",
      "Prepare ice bath. After cooking, lift chicken, drain cavity, lower into ice bath for 15 mins. Drain, cover with plastic until ready to serve. Ice bath stops cooking, locks in juices, and improves skin texture.",
      "While chicken cools, make rice. Heat wok, add chicken fat, render for 1 min. Stir in minced garlic, fry briefly.",
      "Add uncooked rice, stir continuously for 2 mins.",
      "Turn off heat. Scoop rice into rice cooker, add chicken stock and salt. Close lid, press START.",
      "Without rice cooker, soak rice for 20 mins, drain, and follow same steps in a pot with 3 cups chicken stock and salt. Simmer covered for 10-15 mins.",
      "While rice cooks, prepare dipping sauces. Grind ginger and garlic in a food processor. Heat oil, fry ginger and garlic until aromatic. Add salt, transfer to sauce dish."
    ]
  },
  {
    "title": "Ke bah png",
    "chinTitle": "鷄肉飯",
    "cuisine": "TW",
    "username": "auth0|662a1bef93cc4d2e64f5b17b",
    "prepTime": 5,
    "cookTime": 85,
    "servings": 6,
    "picture": "https://live.staticflickr.com/65535/51720059627_0aed2b149b_o.jpg",
    "ingredients": [
      "2 pounds bone-in turkey pieces",
      "½ teaspoon kosher salt",
      "½ teaspoon white pepper, divided",
      "¼ cup vegetable oil",
      "2 shallots, thinly sliced",
      "½ cup water",
      "1 teaspoon sugar",
      "1 teaspoon soy sauce",
      "1 tablespoon Sichuan peppercorns",
      "Fresh cilantro leaves, for garnish",
      "Cooked white rice, for serving"
    ],
    "recipeInstructions": [
      "Rub turkey with ¼ teaspoon each of salt and white pepper.",
      "In a large pot with a lid and a steamer rack, add 2 cups water. Place the turkey on a dish on top of the steamer rack. Avoid placing directly on a rack with holes to save drippings. Bring to a boil, then simmer and cover. Steam turkey until internal temperature near the bone reaches 180°F, about 30 minutes. Let cool and reserve the juices.",
      "Cool turkey, pull meat into bite-size shreds, and discard bones and skin.",
      "Heat vegetable oil in a pot. Add sliced shallots and cook until golden brown, about 3 minutes. Transfer to a paper towel-lined plate and reserve the cooking oil.",
      "Combine shallot cooking oil with ½ cup reserved turkey juices. Add water, sugar, soy sauce, Sichuan peppercorns, and ¼ teaspoon each of salt and white pepper. Add half of the fried shallots, saving the rest for garnish. Whisk over medium heat to dissolve sugar. Bring to a gentle boil and simmer, uncovered until sauce is reduced by half, about 30 minutes. Strain sauce and discard solids.",
      "To serve, scoop rice into bowls and top with shredded turkey. Spoon sauce over each bowl. Finish with fried shallots and cilantro for garnish."
    ]
  },
  {
    "title": "Bakpia",
    "chinTitle": "肉餅",
    "cuisine": "ID",
    "username": "auth0|662a1c0093cc4d2e64f5b185",
    "prepTime": 25,
    "cookTime": 20,
    "servings": 13,
    "picture": "https://i2.wp.com/yogyakarta-tours.com/wp-content/uploads/2020/08/bakpia-bisnisukm.jpg?resize=1024%2C590&ssl=1",
    "ingredients": [
      "¼ kg split yellow mung beans",
      "150 gr flour",
      "3 tbsp sugar",
      "1 tbsp salted butter",
      "2 tbsp yeast",
      "1 tsp salt",
      "2 tbsp milk",
      "1 tsp baking powder",
      "¼ kg vegetable oil",
      "1 glass warm water"
    ],
    "recipeInstructions": [
      "Soak mung beans in water for 1 hour, then steam them.",
      "Blend steamed mung beans with 1 tbsp sugar and salt to make small balls.",
      "Mix yeast, 1 tbsp sugar, and 5 tbsp warm water in a glass until bubbly (5-7 minutes).",
      "Let small dough rest for 30 minutes, covered with a clean towel.",
      "Roll out the dough on an oiled surface.",
      "Fill dough with mung beans or chocolate.",
      "Shape into balls and press them.",
      "Brush a pan with butter or vegetable oil, then heat it.",
      "Bake filled dough for 5 minutes on each side."
    ]
  },
  {
    "title": "Tikoy",
    "chinTitle": "甜粿",
    "cuisine": "PH",
    "username": "auth0|662a1c1093cc4d2e64f5b18f",
    "prepTime": 5,
    "cookTime": 65,
    "servings": 8,
    "picture": "https://i0.wp.com/www.angsarap.net/wp-content/uploads/2021/03/Peanut-Tikoy-Rolls-Wide.jpg?fit=1080%2C720&ssl=1",
    "ingredients": [
      "canola oil",
      "1 cup sugar",
      "1 ¼ cups water",
      "2 ½ glutinous rice flour",
      "2 eggs"
    ],
    "recipeInstructions": [
      "Boil water in a steamer pot. Place a steamer basket over it.",
      "Brush a round pan with oil. Mix sugar and water until dissolved.",
      "In a large bowl, mix glutinous rice flour with water until smooth.",
      "Pour batter into the oiled pan. Steam for 50-60 minutes until a toothpick comes out clean.",
      "Cool, loosen edges with a knife, and invert on a surface lined with plastic film.",
      "Wrap in plastic film and refrigerate for 4 hours to overnight.",
      "Heat 2 tablespoons oil in a pan. Slice tikoy into ¼ inch pieces.",
      "Beat eggs in a bowl. Dip slices in beaten eggs.",
      "Fry slices in the pan for 2-3 minutes on each side until golden brown and crispy outside, soft inside."
    ]
  }
]
